Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །དེ་ནི་དབང་པོ་ཞན་པ་དང་། འབྲིང་དང་རབ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the weak, the medium, and the superior faculties. He knows perfectly their connection or nonconnection with the past and the future; their superiority, mediocrity, and inferiority; their being connate with and inseparable from the kleśas; their being yānas or not yānas, definite or indefinite;

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐར་ཐ་དད་པ་དང་། ཐ་མི་དད་པ་དང་། ཡངས་པ་དང་། འབྲིང་དང་ཐ་མ་དང་། ཉོན་མོངས་པ་དང་། ལྷན་ཅིག་ཏུ་སྐྱེས་ཤིང་ཐ་མི་དད་པ་དང་། ཐེག་པ་དང་ཐེག་པ་མ་ཡིན་པར་ངེས་པ་དང་། མ་ངེས་པ་དང་། ཡོངས་སུ་སྨིན་པའི་ཚུལ་བཞིན་དུ་འདུལ་བ་དང་། དབང་པོའི་དྲ་བའི་རྗེས་སུ་འབྲང་ཞིང་མྱུར་དུ་འཇིག་པ་དང་། མཚན་མར་འཛིན་པ་དང་། དབང་པོའི་དབང་གཞན་གྱིས་མྱི་ཐུལ་བ་དང་། དབང་པོའི་རྣམ་པ་ཕྱིར་བཟློག་ཏུ་རུང་བ་དང་། ཕྱིར་བཟློག་ཏུ་མི་རུང་བ་དང་། རིང་དུ་སོང་བ་དང་། ལྷན་ཅིག་སྐྱེས་པ་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་པ་ནས་དབང་པོ་རྣམ་པ་ཐ་དད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: the ripened and unripened who are to be guided; following the net of the faculties, swift disintegration, and the grasping of features; the invincibility of power over the faculties; the difference between the faculties that can regress and those that cannot regress; the various kinds that are developed and those that are innate; and so on—in brief eighty-four thousand different kinds of faculties.

source: །དེ་ནི་མོས་པ་ཞན་པ་དང་འབྲིང་དང་། རབ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་ནས། དབང་པོའི་ཚུལ་བཞིན་དུ་མོས་པ་རྣམ་པ་ཐ་དད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “He knows perfectly the aspirations that are weak, medium, superior, and so on, knowing perfectly eighty-four thousand different kinds of aspiration.

source: །དེ་ནི་ཁམས་ཐ་མ་དང་འབྲིང་དང་། རབ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་ནས་ཁམས་རྣམ་པ་ཐ་དད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “He knows perfectly the constituents that are weak, medium, superior, and so on, knowing perfectly eighty-four thousand different kinds of constituents.

source: །དེ་ནི་བསམ་པ་ཐ་མ་དང་འབྲིང་དང་། རབ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་ནས་བསམ་པ་རྣམ་པ་ཐ་དད་པ་སྟོང་ཕྲག་དུ་མའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “He knows perfectly the motivations that are weak, medium, superior, and so on, knowing perfectly eighty-four thousand different kinds of motivation. “He knows perfectly the propensities that are connate with motivation and connate with mind;

source: །དེ་ནི་བག་ལ་ཉལ་བ་རྣམས་བསམ་པ་དང་ལྷན་ཅིག་སྐྱེས་པ་དང་། སེམས་དང་ལྷན་ཅིག་སྐྱེས་པ་དང་། སེམས་དང་ལྡན་པ་དང་། སེམས་དང་མྱི་ལྡན་པ་དང་རིང་དུ་སོང་བ་དང་། ཐོག་མ་མེད་པ་ནས།
en: their being conjoined with mind, not conjoined with mind, and followed for a long time;

source: གུད་དུ་མ་བསྐྱོད་པ་དང་། བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་བཟོད་པར་དཀའ་བ་དང་། ཁམས་གསུམ་པའི་མཚམས་ཤིན་ཏུ་སྦྱོར་བ་དང་། ཐོག་མ་མེད་པའི་དུས་ཀྱི་སེམས་ཀྱི་རྒྱུད་ཀུན་ཏུ་རྒྱུ་བར་བྱེད་པ་དང་། སྐྱེ་བའི་སྒོ་ཀུན་ནས་འབྱུང་བ་རྣམ་པར་དམྱིགས་པར་བྱེད་པ་དང་། གཉེན་པོ་ཐོབ་པས་དངོས་པོར་མྱི་འགྱུར་བ་དང་། སའི་སྐྱེ་མཆེད་དང་ཕྲད་པ་དང་། མི་ཕྲད་པ་དང་། འཕགས་པའི་ལམ་ཐ་དད་པ་མྱེད་པས་ཡང་དག་པར་བསྩལ་བ།
en: that they are beginningless and unrevealed; that they cannot be conquered by dhyānas, liberations , samādhis, samāpattis, or clairvoyances; their binding a connection with the three realms; their beginningless activity of binding the mind; their being known through arising through the doorways of the sensory bases; their becoming nothing after acquiring their antidotes; their encounter and nonencounter in the bhūmis and the sensory bases; and their elimination by nothing other than the noble path.

source: ཡང་དག་པ་ཇི་ལྟ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “He knows perfectly the different kinds of birth.

source: །དེ་ནི་སྐྱེ་བ་རྣམ་པ་ཐ་དད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: He knows perfectly the way in which birth occurs in accordance with karma;

source: ལས་ཇི་ལྟ་བ་བཞིན་དུ་སྐྱེ་བ་དང་། སེམས་ཅན་དམྱལ་བ་དང་བྱོལ་སོང་དང་ཡི་དགས་དང་། ལྷ་མ་ཡིན་དང་། མྱི་དང་། ལྷའི་གནས་རྣམ་པར་དགོད་པ་དང་། གཟུགས་དང་གཟུགས་མྱེད་པར་སྐྱེ་བ་དང་། འདུ་ཤེས་ཡོད་པ་དང་འདུ་ཤེས་མྱེད་པར་སྐྱེ་བ་དང་། ལས་ཀྱི་ཞིང་དང་། སྲེད་པའི་རླན་དང་། མ་རིག་པའི་མུན་པ་དང་། རྣམ་པར་ཤེས་པའི་ས་བོན་གྱིས་ཡང་སྲིད་པ་རབ་ཏུ་འབྱུང་བ་དང་། མྱིང་དང་གཟུགས་ལྷན་ཅིག་སྐྱེས་ཤིང་ཐ་མྱི་དད་པ་དང་། སྲིད་པར་འགྲོ་ཡང་ཁྱེར་ཞིང་སྲེད་པས་མངོན་པར་མོས་པའི་མཚམས་སྦྱོར་བ་དང་། སྤྱོད་པར་འདོད་པ་དང་། འབྱུང་བར་འདོད་པ་དང་། སེམས་ཅན་ལ་མོས་པ་དང་། ཐོག་མ་དང་ཐ་མ་མྱེད་པ་དང་། ཁམས་གསུམ་པ་ཡོངས་སུ་འཛིན་པ་དང་། སྲིད་པ་ཉིང་གི་མཚམས་སྦྱོར་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: the differen­tiation of hell beings, animals, pretas, asuras, humans, and devas; birth in the form and formless realms; birth with perception and without perception; the production of rebirth through the realm of karma, the moisture of craving, the darkness of ignorance, and the seed of consciousness; the simultaneous arising and inseparability of name-and-form; the conjunction of different kinds of birth with desire for existence because of ignorance and craving; the endless and beginningless desire for enjoyment, desire for rebirth, and passion for beings; and the state of being drawn along by the perception that fixates on the realms.

source: །དེ་ནི་བག་ཆགས་རྣམས་རྒྱུ་བ་དང་མྱི་རྒྱུ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the activity or nonactivity of the tendencies. He knows perfectly the presence of the tendencies that bind one to the classes of existence;

source: །ལམ་གྱི་རྒྱུད་གང་དང་ཇི་ལྟར་འབྲེལ་བའི་བག་ཆགས་ཀྱིས་བསྒོས་པ་དང་། སེམས་ཅན་སྤྱད་པ་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་བསྒོས་པ་དང་། ལས་དང་ཉོན་མོངས་པ་ལ་གོམས་པ་ཇི་ལྟ་བ་བཞིན་དུ་བསྒོས་པ་དང་། དགེ་བ་དང་མྱི་དགེ་བ་དང་། ལུང་དུ་མ་བསྟན་པའི་ལས་ལ་གོམས་པས་བསྒོས་པ་དང་། ཡང་སྲིད་པར་འགྲོ་བར་བསྒོས་པ་དང་། མཐར་གྱིས་བསྒོས་པ་དང་། རིང་དུ་སོང་ཞིང་རྒྱུན་མི་འཆད་པ་དང་། ཉོན་མོངས་པ་བསྩལ་བས་བསྒོས་པ་དང་། དངོས་པོར་གྱུར་པ་དང་དངོས་པོར་མ་གྱུར་པས་བསྒོས་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་ཞིང་ཐོས་པས་བསྒོས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: the presence of the tendencies that follow from the conduct of beings; the presence of the tendencies that cause karma and kleśas to repeat; the presence of the tendencies that repeat good, bad, and neutral actions; the presence of the tendencies that lead to rebirth; the presence of the tendencies for successive developments; the presence of the tendencies to persist in acquiring an accumulation of long-lasting, continuous kleśas; the presence of the tendencies toward the substantial and the insubstantial; and the presence of the tendencies for seeing, hearing, and remaining among śrāvakas, pratyekabuddhas, bodhisattvas, and tathāgatas.

source: །དེ་ནི་སེམས་ཅན་གྱི་ཕུང་པོ་ཡང་དག་པར་ངེས་པ་དང་། ལོག་པར་ངེས་པ་དང་། གཉིས་ཀར་མ་ངེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the groups of beings that are definitively correct, definitively incorrect, and indefinite in being neither.

source: ཡང་དག་པར་ལྟ་བས་ཡང་དག་པར་ངེས་པ་དང་། ལོག་པར་ལྟ་བས་ལོག་པར་ངེས་པ་དང་། དེ་གཉིས་ཀ་དང་བྲལ་བས་མ་ངེས་པ་དང་། མཚམས་མྱེད་པ་ལྔ་ལས་གང་ཡང་རུང་བར་ལོག་པར་ངེས་པ་དང་། དབང་པོ་ལྔར་ཡང་དག་པར་ངེས་པ་དང་། དེ་གཉིས་ཀ་དང་བྲལ་བས་མ་ངེས་པ་དང་། ལོག་པ་བརྒྱད་དུ་ལོག་པར་ངེས་པ་དང་། ཡང་དག་པ་ལ་ཡང་དག་པར་ངེས་པ་དང་། ཕྱིས་བྱར་མྱེད་པ་དང་དེ་གཉིས་ཀ་དང་བྲལ་བས་མ་ངེས་པ་དང་། སེར་སྣ་དང་ཕྲག་དོག་དང་། སྙིང་མྱི་བརྩེ་བ་ལ་ཉེ་བར་སྤྱོད་པ་མ་བཏང་བས་ལོག་པར་ངེས་པ་དང་། འཕགས་པ་བླ་ན་མེད་པའི་ལམ་བསྒོམས་པས་ཡང་དག་པར་ངེས་པ་དང་། དེ་གཉིས་ཀ་དང་བྲལ་བས་མ་ངེས་པའི་ཕུང་པོར་བསྟན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows those who are definitively correct in having correct views, those who are definitively incorrect in having incorrect views, and those who are indefinite in being neither; those who are definitively incorrect in having any of the five karmas with immediate result on death, those who are definitively correct in having the five powers, and those who are indefinite in being neither; those who are definitively incorrect in having the eight errors, those who are definitively correct in having the correct eight, and those who do not have these actions and are indefinite in being neither; those who are definitively incorrect in not avoiding the conduct of greed, envy, and cruelty, those who are definitively correct in accomplishing the cultivation of the noble superior path, and the teaching of those who are indefinite in being neither.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་པས་ས་ལེགས་པའི་བློ་གྲོས་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་སྟེ།
en: “O jinaputras! It is said that the bodhisattva who is on the bodhisattva bhūmi called Perfect Understanding has that kind of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སེམས་ཅན་གྱི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་དེ་ལྟ་བུ་དག་ཡོངས་སུ་ཤེས་ནས། དེའི་ཚུལ་བཞིན་དུ་ཐར་པ་ཉེ་བར་བསྒྲུབ་པ་ཉེ་བར་སྒྲུབ་བོ།
en: The bodhisattva who is on the bodhisattva bhūmi called Perfect Understanding knows perfectly the various kinds of conduct that beings have, and he accordingly accomplishes their accomplishment of liberation.

source: །དེ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། སེམས་ཅན་གདུལ་བ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་བསྟན་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བསྟན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ས་བསྟན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly the ripening of beings, the guiding of beings, the teaching of the Śrāvaka­yāna, the teaching of the Pratyeka­buddha­yāna, the teaching of the Bodhisattva­yāna, and the teaching of the bhūmi of the tathāgatas.

source: །དེས་དེ་ལྟར་ཤེས་ནས་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཏེ།
en: With that knowledge he truly teaches the Dharma to beings. He teaches the Dharma in accordance with their different kinds of motivation; in accordance with their different kinds of propensities; in accordance with their different kinds of capacities; in accordance with their different kinds of aspiration;

source: བསམ་པ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ཇི་ལྟ་བ་དང་། བག་ལ་ཉལ་བ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ཇི་ལྟ་བ་དང་། དབང་པོ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ཇི་ལྟ་བ་དང་། མོས་པ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ཇི་ལྟ་བ་དང་། སྤྱོད་ཡུལ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་ཉེ་བར་བསྒྲུབ་པ་དང་། སྤྱོད་ཡུལ་ཐམས་ཅད་ཀྱི་རྒྱུས་ཁོང་དུ་ཆུད་པ་དང་། ཁམས་ཐིབས་པོ་ཡོངས་སུ་རྒྱུ་བའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། སྐྱེ་བ་དང་། ཉོན་མོངས་པའི་ལས་ཀྱི་བག་ཆགས་རྣམ་པ་གང་དང་གང་ཡོད་པ་ཕྱིར་བཟློག་པར་བྱ་བ་དང་། ཕུང་པོ་རྣམ་པར་དགོད་པའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་ཚུལ་དང་སྦྱར་བ་དང་། ཐེག་པ་གང་ལ་མོས་པའི་རྣམ་པར་ཐར་པ་ཐོབ་པར་བྱ་བས་ཆོས་སྟོན་ཏེ།
en: in accordance with obtaining the wisdom of all their different kinds of conduct; in accordance with the comprehension of the activities of their complexity of sensory constituents; in accordance with the comprehension of their birth into a class of existence and with their karma, kleśas, and tendencies; in accordance with the comprehension of their being within particular groups; and in accordance with the attainment of liberation through the aspiration to a particular yāna.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི། ཆོས་སྨྲ་བ་ཆེན་པོའི་གོ་འཕང་ལ་གནས་ཤིང་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་བསྲུང་བ་ཡིན།
en: “The bodhisattva who is on the bodhisattva bhūmi called Perfect Understanding acts as a great dharmabhāṇaka and protects the treasury of the Dharma of the tathāgatas.

source: དེ་ཆོས་སྨྲ་བའི་ཚུལ་དང་ལྡན་པས་ཡེ་ཤེས་ལ་མཁས་པ་ཚད་མེད་པའི་རྗེས་སུ་སོང་ཞིང་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་བཞིས་མངོན་པར་བསྒྲུབས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་གིས་ཆོས་སྟོན་ཏེ།
en: “He who has reached the state of a dharmabhāṇaka teaches the Dharma with a bodhisattva’s speech, with immeasurable wisdom, with skill, and with the attainment of the four kinds of discerning knowledge.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་བཞི་རྟག་ཏུ་རྒྱུན་མི་ཆད་ཅིང་མ་འདྲེས་པར་ཡང་དག་པར་འབྱུང་ངོ་།
en: He always has, continuously and precisely, the bodhisattva’s four kinds of discerning knowledge.

source: །བཞི་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: “What are these four?

source: ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་དང་། དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་དང་། ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པ་དང་། སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པའོ། །དེ་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: They are the discerning knowledge of phenomena, the discerning knowledge of meaning, the discerning knowledge of definitions, and the discerning knowledge of eloquence.

source: ཆོས་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་རབ་ཏུ་ཤེས་སོ།
en: “Through the discerning knowledge of phenomena he knows the specific characteristics of phenomena.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་ཀྱི་རྣམ་པར་དབྱེ་བ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of meaning he knows the categories of phenomena.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་མ་འདྲེས་པར་བསྟན་པ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of definitions he knows how to teach each phenomenon distinctly.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་འཐུན་པར་རྗེས་སུ་མཚམས་སྦྱར་བ་རྒྱུན་མི་འཆད་པ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of eloquence he knows the continuous, uninterrupted eloquence that accords with phenomena.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་ཀྱི་རང་བཞིན་མྱེད་པ་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the nonexistent nature of phenomena.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་ཀྱི་འབྱུང་བ་དང་། འཇིག་པ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of meaning he knows the rising and setting of phenomena.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་ཐམས་ཅད་རྣམ་པར་དགོད་པ་རྒྱུན་ཆད་པ་མེད་པར་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches the Dharma through continuous designations of all phenomena.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཇི་ལྟར་རྣམ་པར་བཀོད་པ་བཞིན་དུ་འཁྲུག་པ་མྱེད་པ་མཐའ་ཡས་པས་ཆོས་སྟོན་ཏོ། །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: Through the discerning knowledge of eloquence he teaches the Dharma through those designations, endlessly and without confusion.

source: ད་ལྟར་བྱུང་བའི་ཆོས་རྣམ་པར་དབྱེ་བ་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the categories of phenomena that appear in the present.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་འདས་པ་དང་། མ་འོངས་པའི་ཆོས་རྣམ་པར་དབྱེ་བ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of meaning he knows the categories of phenomena that appear in the future.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་མ་འདྲེས་པར་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches the Dharma through the categories of phenomena that appear in the past, future, and present.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་དུས་རེ་རེ་ཞིང་ཆོས་ཀྱི་སྣང་བ་མུ་མྱེད་པར་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of eloquence he teaches the Dharma through the limitless illumination of phenomena in each of those times.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། ཆོས་ཀྱི་བྱེ་བྲག་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the categories of phenomena.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། དོན་གྱི་བྱེ་བྲག་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of meaning he knows the categories of meaning.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་སྐད་ཇི་ལྟ་བ་བཞིན་དུ་བསྟན་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches the Dharma with the appropriate language.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of eloquence he teaches the Dharma in accordance with the dispositions of others.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་ཀྱི་རྒྱུས་རྣམ་པར་དབྱེ་བ་མ་འདྲེས་པ་མཁས་པར་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he has the knowledge of skillfulness in the distinct categories of the understanding of phenomena.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་རྗེས་སུ་འགྲོ་བའི་ཡེ་ཤེས་དེ་བཞིན་ཉིད་དུ་རྣམ་པར་དགོད་པ་རབ་ཏུ་ཤེས་སོ།
en: Through the discerning knowledge of meaning he knows the accurate presentation of the understanding of their connection.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཀུན་རྫོབ་ཀྱི་རྒྱུས་ཡང་དག་པར་བསྟན་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches relative understanding.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་དོན་དམ་པའི་རྒྱུ་ལ་མཁས་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of eloquence he teaches the Dharma with skill in ultimate understanding.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཆོས་རྣམས་ཚུལ་གཅིག་ལས་མི་འགྱུར་བ་རབ་ཏུ་ཤེས་སོ། །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཕུང་པོ་དང་། ཁམས་དང་སྐྱེ་མཆེད་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མཁས་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཡང་དག་པར་འཇུག་གོ །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་འགྲོ་བ་ཐམས་ཅད་མངོན་པར་སྨོན་པའི་སྒྲ་དབྱངས་ཤིན་ཏུ་སྙན་པའི་ཚིག་གིས་ཆོས་སྟོན་ཏོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the unchanging single mode of phenomena. Through the discerning knowledge of meaning he is skilled in skandhas, sensory elements, sensory bases, and dependent origination. Through the discerning knowledge of definitions he teaches phenomena with pleasing words that all beings are attracted to.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། ཕྱི་ཕྱིར་ཞིང་དྲན་པ་མཐའ་ཡས་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of eloquence he teaches further and further with limitless illumination.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཐེག་པ་གཅིག་ལ་ཡང་དག་པར་གཞོལ་བ་ཐ་དད་པ་རབ་ཏུ་ཤེས་སོ། །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཐེག་པ་རབ་ཏུ་རྣམ་པར་ཕྱེ་བའི་རྣམ་པ་ཐ་དད་པ་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the many ways of entering one yāna. Through the discerning knowledge of meaning he knows the various categories of the yānas.

source: །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཐེག་པ་ཐམས་ཅད་ཐ་དད་པ་མེད་པར་ཤིན་ཏུ་སྟོན་ཏོ། །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་ཐེག་པ་རེ་རེ་ལ་ཡང་ཆོས་ཀྱི་སྣང་བ་མུ་མྱེད་པར་ཤིན་ཏུ་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches that there is no difference between all the yānas. Through the discerning knowledge of eloquence he teaches endless illuminations of phenomena in each yāna.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་དང་། ཆོས་ཀྱི་སྤྱོད་པ་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་རབ་ཏུ་འཇུག་གོ །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: “Moreover, through the discerning knowledge of phenomena he knows that all bodhisattva conduct, wisdom conduct, and Dharma conduct lead to the realization of wisdom.

source: ས་བཅུ་རྣམ་པར་དགོད་ཅིང་། ཤིན་ཏུ་བསྟན་པ་རྣམ་པར་ཕྱེ་བ་ལ་ཡང་དག་པར་འཇུག་གོ །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: Through the discerning knowledge of meaning he comprehends the categories of the teaching and presentation of the ten bhūmis.

source: སའི་ལམ་ཇི་ལྟ་བ་བཞིན་དུ་ཉེ་བར་བསྒྲུབ་པ་ཐ་མྱི་དད་པར་ཡང་དག་པར་སྟོན་ཏོ།
en: Through the discerning knowledge of definitions he teaches the categories of accomplishments on the path of the bhūmis.

source: །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: Through the discerning knowledge of eloquence he teaches the endless aspects of each bhūmi.

source: ས་རེ་རེ་ཞིང་རྣམ་པ་མུ་མྱེད་པར་ཡང་དག་པར་སྟོན་ཏོ། །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཚན་ཉིད་གཅིག་ཏུ།
en: “Moreover, through the discerning knowledge of phenomena he comprehends the single characteristic of all tathāgatas.

source: ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་རབ་ཏུ་འཇུག་གོ །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་དུས་དང་དངོས་པོ་དང་། མཚན་ཉིད་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་ཁོང་དུ་ཆུད་པར་བྱ་བ་རབ་ཏུ་ཤེས་སོ། །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། ཁོང་དུ་ཆུད་པ་རྣམ་པར་ཕྱེ་བ་ཇི་ལྟ་བ་བཞིན་དུ་བསྟན་པས་ཆོས་སྟོན་ཏོ། །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། ཆོས་ཀྱི་ཚིག་རེ་རེ་ལ་ཡང་བསྐལ་པ་མཐའ་ཡས་པར་རྒྱུན་མི་ཆད་པར་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of meaning he knows their concordance with various categories of time, matter, and characteristics. Through the discerning knowledge of definitions he teaches the categories of the nature of realization. Through the discerning knowledge of eloquence he can teach continuously for endless eons on each word of the Dharma.

source: །གཞན་ཡང་ཆོས་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསུང་དང་། སྟོབས་དང་། མྱི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱམས་པ་ཆེན་པོ་དང་། ཐུགས་རྗེ་ཆེན་པོ་དང་། ཐ་དད་པ་ཡང་དག་པར་མཁྱེན་པའི་ཚུལ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བ་རབ་ཏུ་ཤེས་སོ།
en: “Moreover, through the discerning knowledge of phenomena he knows the speech, strengths, confidences, unique buddha qualities, great compassion, discerning knowledge, the turning of the Dharma wheel, and the realization of omniscience of all tathāgatas.

source: །དོན་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས་སེམས་ཅན་གྱི་སྤྱོད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་། བསམ་པ་ཇི་ལྟ་བ་དང་། དབང་པོ་ཇི་ལྟ་བ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་གསུང་རབ་ཏུ་ཤེས་སོ། །ངེས་པའི་ཚིག་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: Through the discerning knowledge of meaning he knows the speech of the tathāgatas that accords with the eighty-four thousand conducts, motivations, capacities, and aspirations of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་། མ་འདྲེས་པའི་དེ་བཞིན་གཤེགས་པའི་གསུང་རྗེས་སུ་བསྒྲགས་པས་ཆོས་སྟོན་ཏོ། །སྤོབས་པ་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པས།
en: Through the discerning knowledge of definitions he makes known the words of the Tathāgata, which are distinct from the conduct of beings.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འོད་གསལ་བ་དང་། སྤྱོད་པའི་དཀྱིལ་འཁོར་ལ་མོས་པས་ཆོས་སྟོན་ཏོ།
en: Through the discerning knowledge of eloquence he teaches the Dharma with the aspiration for the field of conduct that is the radiance of the wisdom of the tathāgatas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་ཐ་དད་པ་ཡང་དག་པར་ཤེས་པའི་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་མཛོད་ཐོབ་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་ལ་གནས་པ་ཆོས་སྨྲ་བ་ཆེན་པོའི་གོ་འཕང་ལ་གནས་པའི་ཚེ།
en: “O jinaputras! The bodhisattva who is skilled in having that wisdom of discerning knowledge has attained the ninth bodhisattva bhūmi, has obtained the treasure of the Dharma of tathāgatas, and has become a great dharmabhāṇaka.

source: དོན་དང་ལྡན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: At that time he attains the dhāraṇī of meaning.

source: ཆོས་དང་ལྡན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: He attains the dhāraṇī of the Dharma.

source: ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་དང་ལྡན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: He attains the dhāraṇī of the accomplishment of wisdom.

source: སྣང་བ་དང་ལྡན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: He attains the dhāraṇī of radiance.

source: བློ་གྲོས་བཟང་པོ་དང་ལྡན་པའི་གཟུངས་དང་། དབྱིག་དང་ལྡན་པའི་གཟུངས་དང་། གྲགས་པ་དང་ལྡན་པའི་གཟུངས་དང་། གཟི་བརྗིད་དང་ལྡན་པའི་གཟུངས་དང་། ཆགས་པ་མེད་པའི་སྒོའི་གཟུངས་དང་། མཐའ་ཡས་པ་དང་ལྡན་པའི་གཟུངས་དང་། དོན་སྣ་ཚོགས་ཀྱི་མཛོད་དང་ལྡན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: He attains the dhāraṇī of perfect understanding , the dhāraṇī of wealth, the dhāraṇī of fame, the dhāraṇī of majesty, the dhāraṇī of unimpeded doors, the dhāraṇī of the infinite, and the dhāraṇī of a treasury of various meanings.

source: དེ་གཟུངས་དེ་དག་ལ་སོགས་པ་གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མྱེད་པ་ཕྲག་བཅུ་ཡོངས་སུ་ཚང་བར་འཐོབ་སྟེ།
en: He has attained the completion of those and other dhāraṇīs, countless millions of dhāraṇī doors.

source: །གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མྱེད་པ་ཕྲག་བཅུ་དང་ལྡན་པའི་དབྱངས་ཀྱི་ཡན་ལག་ལ་མཁས་པས་དེ་སྙེད་དུ་ཚད་མེད་པ་ཉིད་དང་ལྡན་པའི་སྤོབས་པ་རྣམ་པར་ཕྱེ་བའི་སྒོས་ཆོས་སྟོན་ཏོ།
en: He is skilled in the aspects of speech through possessing countless millions of dhāraṇī doors, and he therefore teaches the Dharma through incalculable doors of different kinds of eloquence.

source: །དེ་དེ་ལྟར་ཚད་མྱེད་པའི་གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མྱེད་པས་ཚད་མྱེད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཉན་ཅིང་ཐོས་ནས་ཀྱང་བརྗེད་པར་མྱི་བྱེད་དེ།
en: “Because of those incalculable, countless millions of dhāraṇīs, when he hears the Dharma from countless buddhas in the ten directions, he does not forget what he has heard.

source: ཇི་སྐད་དུ་ཐོས་པ་ཡང་ཚད་མྱེད་པ་རྣམ་པར་ཕྱེ་བས་ཤིན་ཏུ་སྟོན་ཏོ།
en: He then gives countless different teachings that he has heard.
